:PROPERTIES:
:ID:       6c837f3a-5290-4a68-af44-52caea643e34
:END:
#+TITLE: Container Lab
#+DESCRIPTION:
#+TAGS:


*** Node Types

By example

#+begin_src shell
# LOL that's a work of art
grep -e 'kind: ' /data/ecto/vyos/srl-labs/containerlab/lab-examples/**/*.yml  \
    | rev | sort | sed -e 's/.*:dnik.*:\(lmy.*\)\/sel.*/\1/g' \
    | rev | uniq -c
#+end_src

#+RESULTS:
|  1 | srlvjunos02/srlvjunos02.clab.yml |
|  2 | k8s_kind01/k8s_kind01.clab.yml   |
|  1 | srlcrpd01/srlcrpd01.clab.yml     |
|  1 | srlxrd01/srlxrd01.clab.yml       |
|  1 | freebsd01/freebsd01.clab.yml     |
|  1 | openbsd01/openbsd01.yml          |
|  1 | br01/br01.clab.yml               |
|  1 | ixiac01/ixiac01.clab.yml         |
|  2 | fortigate/fortigate.clab.yml     |
|  1 | srlvjunos01/srlvjunos01.clab.yml |
|  1 | vr04/vr04.clab.yml               |
|  1 | generic_vm01/generic_vm.clab.yml |
|  3 | k8s_kind01/k8s_kind01.clab.yml   |
|  1 | srlceos01/srlceos01.clab.yml     |
|  1 | vr01/vr01.clab.yml               |
|  1 | vr05/vr01.clab.yml               |
|  1 | cert01/cert01.clab.yml           |
|  1 | vr05/sros4.clab.yml              |
|  1 | vxlan01/vxlan-sros.clab.yml      |
|  1 | sonic01/sonic01.clab.yml         |
|  1 | ftdv01/ftdv01.yml                |
|  1 | vr03/vr03.clab.yml               |
|  1 | vr02/vr02.clab.yml               |
|  1 | vxlan01/vxlan-vmx.clab.yml       |
|  1 | vsrx01/vsrx01.yml                |
|  2 | openbsd01/openbsd01.yml          |
|  2 | ftdv01/ftdv01.yml                |
|  2 | vsrx01/vsrx01.yml                |
|  2 | freebsd01/freebsd01.clab.yml     |
|  6 | frr01/frr01.clab.yml             |
|  1 | srlfrr01/srlfrr01.clab.yml       |
|  2 | clos01/clos01.clab.yml           |
|  4 | clos02/clos02.clab.yml           |
|  4 | clos02/setup.clos02.clab.yml     |
|  4 | srl03/srl03.clab.yml             |
|  1 | ost-srl/ost-srl.clab.yml         |
|  1 | cvx01/topo.clab.yml              |
|  1 | cvx02/topo.clab.yml              |
|  1 | ixiac01/ixiac01.clab.yml         |
|  1 | sonic01/sonic01.clab.yml         |
|  1 | k8s_kind01/k8s_kind01.clab.yml   |
|  1 | srlcrpd01/srlcrpd01.clab.yml     |
|  1 | srlxrd01/srlxrd01.clab.yml       |
|  1 | srl01/srl01.clab.yml             |
|  1 | srl-quickstart/srl01.clab.yml    |
|  3 | br01/br01.clab.yml               |
|  1 | srlfrr01/srlfrr01.clab.yml       |
|  1 | vr01/vr01.clab.yml               |
|  1 | vr05/vr01.clab.yml               |
|  1 | srlceos01/srlceos01.clab.yml     |
|  3 | clos01/clos01.clab.yml           |
|  1 | srlvjunos01/srlvjunos01.clab.yml |
|  2 | srl02/srl02.clab.yml             |
|  2 | srl-quickstart/srl02.clab.yml    |
|  1 | vr02/vr02.clab.yml               |
| 10 | clos02/clos02.clab.yml           |
| 10 | clos02/setup.clos02.clab.yml     |
|  1 | srlvjunos02/srlvjunos02.clab.yml |
|  4 | srl03/srl03.clab.yml             |
|  1 | vr03/vr03.clab.yml               |
|  1 | vr04/vr04.clab.yml               |
|  1 | ost-srl/ost-srl.clab.yml         |
|  1 | generic_vm01/generic_vm.clab.yml |
|  1 | cvx01/topo.clab.yml              |
|  1 | cvx02/topo.clab.yml              |

count by =kind=

#+begin_src shell
grep -e 'kind: ' /data/ecto/vyos/srl-labs/containerlab/lab-examples/**/*.yml  \
    | rev | sort | sed -e 's/ :dnik.*//g' \
    | rev | uniq -c
#+end_src

#+RESULTS:
|  1 | juniper_vjunosevolved |
|  2 | k8s-kind              |
|  1 | juniper_crpd          |
|  1 | cisco_xrd             |
|  1 | freebsd               |
|  1 | openbsd               |
|  1 | bridge                |
|  1 | keysight_ixia-c-one   |
|  2 | fortinet_fortigate    |
|  1 | juniper_vjunosswitch  |
|  1 | cisco_xrv9k           |
|  1 | generic_vm            |
|  3 | ext-container         |
|  1 | arista_ceos           |
|  5 | nokia_sros            |
|  1 | sonic-vs              |
|  1 | cisco_ftdv            |
|  1 | cisco_xrv             |
|  2 | juniper_vmx           |
|  1 | juniper_vsrx          |
|  8 | linux                 |
| 17 | linux                 |
|  4 | linux                 |
|  3 | linux                 |
| 52 | nokia_srlinux         |
|  2 | cumulus_cvx           |


